title: Possible Active Directory Password Spray
id: 720f12a7-33cc-4ee8-a10b-4bd1d72667a1
status: experimental
description: Detects multiple failed logons across different users from a single host.
author: Tom3306
date: 2026-06-29
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
    Status:
      - '0xC000006A'
      - '0xC000006D'
  timeframe: 10m
  condition: selection | count(TargetUserName) by IpAddress > 10
falsepositives:
  - Misconfigured service
  - User training labs
level: medium
tags:
  - attack.credential_access
  - attack.t1110

