title: Privileged Active Directory Group Membership Change
id: 8f5619b2-9b37-4d7d-8a44-7051f0b36501
status: experimental
description: Detects users added to privileged Active Directory groups.
author: Tom3306
date: 2026-06-29
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4728
      - 4732
      - 4756
  privileged_groups:
    TargetUserName|contains:
      - Domain Admins
      - Enterprise Admins
      - Administrators
      - Server-Admins
  condition: selection and privileged_groups
falsepositives:
  - Approved administrative change windows
level: high
tags:
  - attack.persistence
  - attack.t1098

